const prayerContainer = document.querySelector(".prays_container");

const allPrays = [
  {
    content:
      "اَللّهُمَّ قَرِّبْني فيهِ اِلى مَرضاتِكَ، وَجَنِّبْني فيهِ مِن سَخَطِكَ وَنَقِماتِكَ، وَوَفِّقني فيهِ لِقِرائَةِ اياتِِكَ، بِرَحمَتِكَ يا أرحَمَ الرّاحمينَ.",
  },
  {
    content:
      "اَللّهُمَّ ارْزُقني فيهِ الذِّهنَ وَالتَّنْبيهِ، وَباعِدْني فيهِ مِنَ السَّفاهَةِ وَالتَّمْويهِ، وَاجْعَل لي نَصيباً مِن كُلِّ خَيْرٍ تُنْزِلُ فيهِ، بِجودِكَ يا اَجوَدَ الأجْوَدينَ.",
  },
  {
    content:
      "اَللّهُمَّ قَوِّني فيهِ عَلى اِقامَةِ اَمرِكَ، وَاَذِقني فيهِ حَلاوَةِ ذِكْرِكَ، وَاَوْزِعْني فيهِ لِأداءِ شُكْرِكَ بِكَرَمِكَ، وَاحْفَظْني فيهِ بِحِفظِكَ وَسَتْرِكَ يا اَبصَرَ النّاظِرينَ.",
  },
  {
    content:
      "اَللّهُمَّ اجعَلني فيهِ مِنَ المُستَغْفِرينَ، وَاجعَلني فيهِ مِن عِبادِكَ الصّالحينَ القانِتينَ، وَاجعَلني فيهِ مِن اَوْليائِكَ المُقَرَّبينَ، بِرَأفَتِكَ يا اَرحَمَ الرّاحمينَ.",
  },
  {
    content:
      "اَللّهُمَّ لا تَخْذُلني فيهِ لِتَعَرُّضِ مَعصِيَتِكَ، وَلاتَضرِبني بِسِياطِ نَقِمَتِكَ، وَزَحْزِحني فيهِ مِن موُجِبات سَخَطِكَ بِمَنِّكَ وَاَياديكَ يا مُنتَهى رَغْبَةِ الرّاغِبينَ.",
  },
  {
    content:
      "اَللّهُمَّ اَعِنّي فيهِ عَلى صِيامِهِ وَقِيامِهِ، وَجَنِّبني فيهِ مِن هَفَواتِهِ وَاثامِهِ، وَارْزُقني فيهِ ذِكْرَكَ بِدَوامِهِ، بِتَوْفيقِكَ يا هادِيَ المُضِّلينَ.",
  },
  {
    content:
      "اَللّهُمَّ ارْزُقْني فيهِ رَحمَةَ الأَيْتامِ وَاِطعامَ الطَّعامِ وَاِفْشاءَ وَصُحْبَةَ الكِرامِ بِطَوْلِكَ يا مَلْجَاَ الأمِلينَ.",
  },
  {
    content:
      "اَللّهُمَّ اجْعَل لي فيهِ نَصيباً مِن رَحمَتِكَ الواسِعَةِ، وَاهْدِني فيهِ لِبَراهينِكَ السّاطِعَةِ، وَخُذْ بِناصِيَتي إلى مَرْضاتِكَ الجامِعَةِ بِمَحَبَّتِكَ يا اَمَلَ المُشتاقينَ.",
  },
  {
    content:
      "اَللّهُمَّ اجْعَلني فيهِ مِنَ المُتَوَكِلينَ عَلَيْكَ، وَاجْعَلني فيهِ مِنَ الفائِزينَ لَدَيْكَ، وَاجعَلني فيه مِنَ المُقَرَّبينَ اِليكَ بِاِحْسانِكَ يا غايَةَ الطّالبينَ.",
  },
  {
    content:
      "اَللّهُمَّ حَبِّبْ اِلَيَّ فيهِ الْإحسانَ، وَكَرِّهْ فيهِ الْفُسُوقَ وَالعِصيانَ وَحَرِّمْ عَلَيَّ فيهِ السَخَطَ وَالنّيرانَ بعَوْنِكَ ياغياثَ المُستَغيثينَ.",
  },
  {
    content:
      "اَللّهُمَّ زَيِّنِّي فيهِ بالسِّترِ وَالْعَفافِ، وَاسْتُرني فيهِ بِلِِِباسِ الْقُنُوعِ وَالكَفافِ، وَاحْمِلني فيهِ عَلَى الْعَدْلِ وَالْإنصافِ، وَآمنِّي فيهِ مِنْ كُلِّ ما اَخافُ بِعِصْمَتِكَ ياعصمَةَ الْخائفينَ.",
  },
  {
    content:
      "اَللّهُمَّ طَهِّرْني فيهِ مِنَ الدَّنسِ وَالْأقْذارِ، وَصَبِّرْني فيهِ عَلى كائِناتِ الْأَقدارِ، وَوَفِّقْني فيهِ لِلتُّقى وَصُحْبَةِ الْأبرارِ بِعَوْنِكَ ياقُرَّةَ عَيْن الْمَساكينِ.",
  },
  {
    content:
      "اَللّهُمَّ لاتُؤاخِذْني فيهِ بالْعَثَراتِ، وَاَقِلْني فيهِ مِنَ الْخَطايا وَالْهَفَواتِ، وَلا تَجْعَلْني فيهِ غَرَضاً لِلْبَلايا وَالأفاتِ بِعزَّتِكَ ياعِزَّ المُسْلمينَ.",
  },
  {
    content:
      "اَللّهُمَّ ارْزُقْني فيهِ طاعةَ الخاشعينَ، وَاشْرَحْ فيهِ صَدري بِانابَةِ المُخْبِتينَ، بِأمانِكَ ياأمانَ الخائفينَ.",
  },
  {
    content:
      "اَللّهُمَّ وَفِّقْني فيهِ لِمُوافَقَةِ الْأبرارِ، وَجَنِّبْني فيهِ مُرافَقَةِ الأشرارِ، وَآوني فيهِ برَحمَتِكَ إلى دارِ القَرارِ بإلهيَّتِكَ يا إله العالمينَ.",
  },
  {
    content:
      "اَللّهُمَّ اهدِني فيهِ لِصالِحِ الأعْمالِ، وَاقضِ لي فيهِ الحوائِجَ وَالآمالِ يا مَنْ لا يَحتاجُ إلى التَّفسيرِ وَالسُّؤالِ، يا عالِماً بِما في صُدُورِ العالمينَ صَلِّ عَلى مُحَمَّدٍ وَآله الطّاهرينَ.",
  },
  {
    content:
      "اَللّهُمَّ نَبِّهني فيهِ لِبَرَكاتِ أسحارِهِ، وَنوِّرْ قَلْبي بِضِياءِ أنوارِهِ، وَخُذْ بِكُلِّ أعْضائِي إلى اتِّباعِ آثارِهِ بِنُورِكَ يا مُنَوِّرَ قُلُوبِ العارفينَ.",
  },
  {
    content:
      "اللّهُمَّ وَفِّر فيهِ حَظّي مِن بَرَكاتِهِ، وَسَهِّلْ سَبيلي إلى خيْراتِهِ، وَلا تَحْرِمْني قَبُولَ حَسَناتِهِ يا هادِياً إلى الحَقِّ المُبينِ.",
  },
  {
    content:
      "اللّهُمَّ افْتَحْ لي فيهِ أبوابَ الجِنان، وَأغلِقْ عَنَّي فيهِ أبوابَ النِّيرانِ، وَوَفِّقْني فيهِ لِتِلاوَةِ القُرانِ يامُنْزِلَ السَّكينَةِ في قُلُوبِ المؤمنين.",
  },
  {
    content:
      "اللّهُمَّ اجْعَلْ لي فيهِ إلى مَرضاتكَ دَليلاً، ولا تَجعَلْ لِلشَّيْطانِ فيهِ عَلَيَّ سَبيلاً، وَاجْعَلِ الجَنَّةَ لي مَنْزِلاً وَمَقيلاً، يا قاضِيَ حَوائج الطالبينَ.",
  },
  {
    content:
      "اللّهُمَّ افْتَحْ لي فيهِ أبوابَ فَضْلِكَ، وَأنزِل عَلَيَّ فيهِ بَرَكاتِكَ، وَوَفِّقْني فيهِ لِمُوجِباتِ مَرضاتِكَ، وَأسْكِنِّي فيهِ بُحْبُوحاتِ جَنّاتَكَ، يا مَجيبَ دَعوَةِ المُضْطَرِّينَ.",
  },
  {
    content:
      "اللّهُمَّ اغْسِلني فيهِ مِنَ الذُّنُوبِ، وَطَهِّرْني فيهِ مِنَ العُيُوبِ، وَامْتَحِنْ قَلبي فيهِ بِتَقْوى القُلُوبِ، يامُقيلَ عَثَراتِ المُذنبين.",
  },
  {
    content:
      "اللّهُمَّ اجْعَلني فيهِ مُحِبّاً لِأوْليائكَ، وَمُعادِياً لِأعْدائِكَ، مُسْتَنّاً بِسُنَّةِ خاتمِ أنبيائكَ، يا عاصمَ قٌلٌوب النَّبيّينَ.",
  },
  {
    content:
      "اللّهُمَّ اجْعَلْ سَعْيي فيهِ مَشكوراً، وَذَنبي فيهِ مَغفُوراً، وَعَمَلي فيهِ مَقبُولاً، وَعَيْببي فيهِ مَستوراً يا أسمَعَ السّامعينَ.",
  },
  {
    content:
      "اللّهُمَّ ارْزُقني فيهِ فَضْلَ لَيلَةِ القَدرِ، وَصَيِّرْ اُمُوري فيهِ مِنَ العُسرِ إلى اليُسرِ، وَاقبَلْ مَعاذيري وَحُطَّ عَنِّي الذَّنب وَالوِزْرَ، يا رَؤُفاً بِعِبادِهِ الصّالحينَ.",
  },
  {
    content:
      "اللّهُمَّ وَفِّرْ حَظِّي فيهِ مِنَ النَّوافِلِ، وَأكْرِمني فيهِ بِإحضارِ المَسائِلِ، وَقَرِّبْ فيهِ وَسيلَتي إليكَ مِنْ بَيْنِ الوَسائِلِ، يا مَن لا يَشْغَلُهُ إلحاحُ المُلِحِّينَ.",
  },
  {
    content:
      "اللّهُمَّ غَشِّني فيهِ بالرَّحْمَةِ، وَارْزُقني فيهِ التَّوفيقَ وَالعِصْمَةَ، وَطَهِّر قَلبي مِن غياهِبِ التُّهمَةِ، يارَحيماً بِعبادِهِ المُؤمنينَ.",
  },
  {
    content:
      "اللّهُمَّ اجْعَلْ صِيامي فيهِ بالشُّكرِ وَالقَبولِ عَلى ما تَرضاهُ وَيَرضاهُ الرَّسولُ مُحكَمَةً فُرُوعُهُ بِالأُصُولِ، بِحَقِّ سَيِّدِنا مُحَمَّدٍ وَآلهِ الطّاهِرينَ، وَالحَمدُ للهِ رَبِّ العالمينَ.",
  },
];

function setPrayerIside() {
  let line = "\r\n\r\n";
  let newLine = window.encodeURIComponent(line);
  allPrays.forEach((prayer, index) => {
    prayerContainer.innerHTML += `<div class="prays_items">
          <p class="pray_content">
            ${prayer.content}
          </p>
          <div class="prays_controls">
            <ul class="prays_social">
              <li class="li_prays">
                <a
                  href="${`https://www.facebook.com/sharer.php?u=${encodeURIComponent(
                    window.location.href + "?prayer=" + Number(index)
                  )}`}"
                  target="_blank"
                  rel="noopener noreferrer"
                  class="social_face"
                  data-title="facebook"
                  ><i class="fab fa-facebook"></i
                ></a>
              </li>
              <li class="li_prays">
                <a
                  href="${`https://wa.me/?text=${prayer.content}`}${newLine}${encodeURIComponent(
      window.location.href + "?prayer=" + Number(index)
    )}"
                  target="_blank"
                  rel="noopener noreferrer"
                  class="social_whats"
                  data-title="whatsapp"
                  ><i class="fab fa-whatsapp"></i
                ></a>
              </li>
              <li class="li_prays">
                <a
                  href="${`https://twitter.com/intent/tweet?url=${encodeURIComponent(
                    window.location.href + "?prayer=" + Number(index)
                  )}&text=${prayer.content}`}"
                  target="_blank"
                  rel="noopener noreferrer"
                  class="social_twitter"
                  data-title="twitter"
                  ><i class="fab fa-twitter"></i
                ></a>
              </li>
              <li class="li_prays">
                <a
                  href="javascript:copyElem(${index})"
                  class="social_clip"
                  data-title="clipboard"
                  ><i class="fas fa-link"></i
                ></a>
              </li>
            </ul>
          </div>
        </div>`;
  });

  let searchPrams = new URLSearchParams(window.location.search);
  if (searchPrams.has("prayer")) {
    let prayerID = Number(searchPrams.get("prayer"));
    if (prayerContainer.children[prayerID]) {
      console.log(prayerContainer.children[prayerID]);
      prayerContainer.children[prayerID].classList.add("selected_elem");
      window.scrollTo({
        top: prayerContainer.children[prayerID].offsetTop,
        left: 0,
        behavior: "smooth",
      });
    } else {
      window.scrollTo({
        top: 0,
        left: 0,
        behavior: "smooth",
      });
    }
  }
}

setPrayerIside();

function copyElem(id) {
  if (navigator.clipboard) {
    navigator.clipboard.writeText(allPrays[id].content);
    let itelem = prayerContainer.children[id].querySelector(".social_clip");
    itelem.setAttribute("data-title", "Copied Successfully");
    setTimeout(() => itelem.setAttribute("data-title", "clipboard"), 1000);
  }
}
